Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetHandler.CreateCurvedDimensionSetOrthogonal Method
Overload List
Name | Description
CreateCurvedDimensionSetOrthogonal(ViewBase, Point, Point, Point, PointList, Double)
 Creates a curved dimension set with orthogonal reference lines from the specified points and inserts it to the database.
CreateCurvedDimensionSetOrthogonal(ViewBase, Point, Point, Point, PointList, Double, CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
 Creates a curved dimension set with orthogonal reference lines from the specified points and inserts it to the database.
Top
See Also
Reference
CurvedDimensionSetHandler Class
Tekla.Structures.Drawing Namespace